In [82]:
from mxnet import ndarray as nd

In [83]:
import pandas as pd

In [84]:
import numpy as np

## 请记住, data alignment is intrinsic
我理解为：标签和数据是一对一的
index和数据也是一一对应的

In [85]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [86]:
s

a    1.575511
b    2.909541
c    0.337388
d    0.342014
e   -1.740802
dtype: float64

In [87]:
train = pd.read_csv("../data/kaggle_house_pred_train.csv")

In [88]:
train.head(n=1)

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
0,1,60,RL,65.0,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500

In [89]:
test = pd.read_csv("../data/kaggle_house_pred_test.csv")

In [90]:
test.head(1)

,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,ScreenPorch,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition
0,1461,20,RH,80.0,11622,Pave,NaN,Reg,Lvl,AllPub,...,120,0,NaN,MnPrv,NaN,0,6,2010,WD,Normal

In [91]:
train.index

RangeIndex(start=0, stop=1460, step=1)

In [92]:
train.shape

(1460, 81)

In [93]:
test.shape

(1459, 80)

In [94]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [95]:
s2 = pd.Series(np.random.randn(5))

In [96]:
s2.index

RangeIndex(start=0, stop=5, step=1)

In [97]:
d = {'a': 0., 'b': 1., 'c': 2.}

In [98]:
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [99]:
pd.Series(d, ['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [100]:
pd.Series(5, ['a', 'b', 'c', 'd'])

a    5
b    5
c    5
d    5
dtype: int64

In [101]:
s

a    1.575511
b    2.909541
c    0.337388
d    0.342014
e   -1.740802
dtype: float64

In [102]:
s[0]

1.5755108480654234

In [103]:
type(s)

pandas.core.series.Series

In [104]:
s[1:3]

b    2.909541
c    0.337388
dtype: float64

In [105]:
s.median()

0.3420144143958583

In [106]:
s>s.median()

a     True
b     True
c    False
d    False
e    False
dtype: bool

In [107]:
z = s>s.median()
z

a     True
b     True
c    False
d    False
e    False
dtype: bool

In [108]:
s [z]

a    1.575511
b    2.909541
dtype: float64

In [109]:
s[[4,3,1]]

e   -1.740802
d    0.342014
b    2.909541
dtype: float64

In [110]:
s

a    1.575511
b    2.909541
c    0.337388
d    0.342014
e   -1.740802
dtype: float64

In [111]:
np.exp(s)

a     4.833210
b    18.348377
c     1.401282
d     1.407781
e     0.175380
dtype: float64

In [112]:
s['a']

1.5755108480654234

In [114]:
s['e'] = 12

In [115]:
s

a     1.575511
b     2.909541
c     0.337388
d     0.342014
e    12.000000
dtype: float64

In [116]:
'e' in s

True

In [117]:
'f' in s

False

In [122]:
s[0] == s['a']

True

In [125]:
s.get('f', np.nan)

nan

In [128]:
s['f'] = 'a'

In [129]:
s

a     1.57551
b     2.90954
c    0.337388
d    0.342014
e          12
f           a
dtype: object

## Vectorized operations and label alignment with Series

In [36]:
import pandas as pd
import numpy as np

In [28]:
%time sum([x for x in range(100000)])

CPU times: user 4.83 ms, sys: 677 µs, total: 5.51 ms
Wall time: 5.51 ms

4999950000

In [29]:
%time sum(x for x in range(100000))

CPU times: user 8.9 ms, sys: 257 µs, total: 9.16 ms
Wall time: 9 ms

4999950000

In [31]:
%magic

In [32]:
%quickref

In [38]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [40]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [41]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [42]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [54]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.date_range('20130101', periods=4),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test", 'train']),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-03  1.0  3   test  foo
3  1.0 2013-01-04  1.0  3  train  foo

In [55]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [56]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [63]:
df2.E

0     test
1    train
2     test
3    train
Name: E, dtype: category
Categories (2, object): [test, train]

## Viewing Data

In [65]:
df.head()

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093

In [67]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [68]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [69]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [79]:
df.values

array([[ 0.13683235,  0.72413194,  0.80213775,  0.06264826],
       [ 0.22825982, -0.14062946,  1.74168205,  0.7747156 ],
       [-0.60577917,  0.98532013, -0.88756325,  1.15128287],
       [-0.73291514,  0.55655363,  0.42379411, -2.29882123],
       [ 0.93089959,  2.66093923,  0.33100227, -1.63909336],
       [-0.25151512, -0.73610909,  0.90833884,  0.51783267]])

In [78]:
for col in df2:
    print(df2[col])

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64
0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
Name: B, dtype: datetime64[ns]
0    1.0
1    1.0
2    1.0
3    1.0
Name: C, dtype: float32
0    3
1    3
2    3
3    3
Name: D, dtype: int32
0     test
1    train
2     test
3    train
Name: E, dtype: category
Categories (2, object): [test, train]
0    foo
1    foo
2    foo
3    foo
Name: F, dtype: object

In [75]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [81]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.049036  0.675034  0.553232 -0.238573
std    0.614876  1.158721  0.865159  1.401957
min   -0.732915 -0.736109 -0.887563 -2.298821
25%   -0.517213  0.033666  0.354200 -1.213658
50%   -0.057341  0.640343  0.612966  0.290240
75%    0.205403  0.920023  0.881789  0.710495
max    0.930900  2.660939  1.741682  1.151283

In [82]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [83]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [84]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-01  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-03  1.0  3   test  foo
3  1.0 2013-01-04  1.0  3  train  foo

In [85]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.136832    0.228260   -0.605779   -0.732915    0.930900   -0.251515
B    0.724132   -0.140629    0.985320    0.556554    2.660939   -0.736109
C    0.802138    1.741682   -0.887563    0.423794    0.331002    0.908339
D    0.062648    0.774716    1.151283   -2.298821   -1.639093    0.517833

In [86]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [88]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.062648  0.802138  0.724132  0.136832
2013-01-02  0.774716  1.741682 -0.140629  0.228260
2013-01-03  1.151283 -0.887563  0.985320 -0.605779
2013-01-04 -2.298821  0.423794  0.556554 -0.732915
2013-01-05 -1.639093  0.331002  2.660939  0.930900
2013-01-06  0.517833  0.908339 -0.736109 -0.251515

In [90]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-01  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-03  1.0
3  foo  train  3  1.0 2013-01-04  1.0

In [91]:
df2.sort_index(axis=0, ascending=False)

     A          B    C  D      E    F
3  1.0 2013-01-04  1.0  3  train  foo
2  1.0 2013-01-03  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-01  1.0  3   test  foo

In [92]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [93]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.251515 -0.736109  0.908339  0.517833
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-05  0.930900  2.660939  0.331002 -1.639093

In [102]:
df.sort_values(by='2013-01-02', axis=1, ascending=False)

                   C         D         A         B
2013-01-01  0.802138  0.062648  0.136832  0.724132
2013-01-02  1.741682  0.774716  0.228260 -0.140629
2013-01-03 -0.887563  1.151283 -0.605779  0.985320
2013-01-04  0.423794 -2.298821 -0.732915  0.556554
2013-01-05  0.331002 -1.639093  0.930900  2.660939
2013-01-06  0.908339  0.517833 -0.251515 -0.736109

## Selection

In [103]:
df['A']  # 选择某一列

2013-01-01    0.136832
2013-01-02    0.228260
2013-01-03   -0.605779
2013-01-04   -0.732915
2013-01-05    0.930900
2013-01-06   -0.251515
Freq: D, Name: A, dtype: float64

In [113]:
df[0:3]  # 取行

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283

In [120]:
df['20130102': '20130104']

                   A         B         C         D
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821

In [121]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [126]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

### Selection by Label

In [127]:
df.loc[dates[0]]

A    0.136832
B    0.724132
C    0.802138
D    0.062648
Name: 2013-01-01 00:00:00, dtype: float64

In [128]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.136832  0.724132
2013-01-02  0.228260 -0.140629
2013-01-03 -0.605779  0.985320
2013-01-04 -0.732915  0.556554
2013-01-05  0.930900  2.660939
2013-01-06 -0.251515 -0.736109

In [134]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [137]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.136832  0.724132
2013-01-02  0.228260 -0.140629
2013-01-03 -0.605779  0.985320
2013-01-04 -0.732915  0.556554
2013-01-05  0.930900  2.660939
2013-01-06 -0.251515 -0.736109

In [148]:
df.loc['2013-01-02',:]

A    0.228260
B   -0.140629
C    1.741682
D    0.774716
Name: 2013-01-02 00:00:00, dtype: float64

In [149]:
df.loc['2013-01-02', 'A']

0.22825982449063315

In [159]:
df.loc[dates[0:2], ['A','B']]

                   A         B
2013-01-01  0.136832  0.724132
2013-01-02  0.228260 -0.140629

In [152]:
df.at[dates[0], 'A']

0.13683234890537424

In [160]:
dates[0:2]

DatetimeIndex(['2013-01-01', '2013-01-02'], dtype='datetime64[ns]', freq='D')

### selection by position

In [161]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [162]:
df.iloc[3]

A   -0.732915
B    0.556554
C    0.423794
D   -2.298821
Name: 2013-01-04 00:00:00, dtype: float64

In [166]:
df[3:4]

                   A         B         C         D
2013-01-04 -0.732915  0.556554  0.423794 -2.298821

In [168]:
df.iloc[[1,2,2],[0,2]]

                   A         C
2013-01-02  0.228260  1.741682
2013-01-03 -0.605779 -0.887563
2013-01-03 -0.605779 -0.887563

In [169]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283

In [170]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.724132  0.802138
2013-01-02 -0.140629  1.741682
2013-01-03  0.985320 -0.887563
2013-01-04  0.556554  0.423794
2013-01-05  2.660939  0.331002
2013-01-06 -0.736109  0.908339

In [171]:
df.iloc[1,1]

-0.14062946217590983

### boolean indexing

In [172]:
pd.Series([False, True, False])

0    False
1     True
2    False
dtype: bool

In [173]:
if pd.Series([False, True, False]):
    print("I was true")

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [174]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [176]:
df>0

                A      B      C      D
2013-01-01   True   True   True   True
2013-01-02   True  False   True   True
2013-01-03  False   True  False   True
2013-01-04  False   True   True  False
2013-01-05   True   True   True  False
2013-01-06  False  False   True   True

In [177]:
df[df>0]

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260       NaN  1.741682  0.774716
2013-01-03       NaN  0.985320       NaN  1.151283
2013-01-04       NaN  0.556554  0.423794       NaN
2013-01-05  0.930900  2.660939  0.331002       NaN
2013-01-06       NaN       NaN  0.908339  0.517833

In [178]:
df.A>0

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [179]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-05  0.930900  2.660939  0.331002 -1.639093

In [180]:
df2 = df.copy()

In [182]:
df2['E'] = ['one', 'one','two','three','four','three']

In [183]:
df,df2

(                   A         B         C         D
 2013-01-01  0.136832  0.724132  0.802138  0.062648
 2013-01-02  0.228260 -0.140629  1.741682  0.774716
 2013-01-03 -0.605779  0.985320 -0.887563  1.151283
 2013-01-04 -0.732915  0.556554  0.423794 -2.298821
 2013-01-05  0.930900  2.660939  0.331002 -1.639093
 2013-01-06 -0.251515 -0.736109  0.908339  0.517833,
                    A         B         C         D      E
 2013-01-01  0.136832  0.724132  0.802138  0.062648    one
 2013-01-02  0.228260 -0.140629  1.741682  0.774716    one
 2013-01-03 -0.605779  0.985320 -0.887563  1.151283    two
 2013-01-04 -0.732915  0.556554  0.423794 -2.298821  three
 2013-01-05  0.930900  2.660939  0.331002 -1.639093   four
 2013-01-06 -0.251515 -0.736109  0.908339  0.517833  three)

In [184]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [189]:
df2[df2['E'].isin(['one', 'four',])]

                   A         B         C         D     E
2013-01-01  0.136832  0.724132  0.802138  0.062648   one
2013-01-02  0.228260 -0.140629  1.741682  0.774716   one
2013-01-05  0.930900  2.660939  0.331002 -1.639093  four

###  Setting

In [190]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [192]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [193]:
df

                   A         B         C         D
2013-01-01  0.136832  0.724132  0.802138  0.062648
2013-01-02  0.228260 -0.140629  1.741682  0.774716
2013-01-03 -0.605779  0.985320 -0.887563  1.151283
2013-01-04 -0.732915  0.556554  0.423794 -2.298821
2013-01-05  0.930900  2.660939  0.331002 -1.639093
2013-01-06 -0.251515 -0.736109  0.908339  0.517833

In [194]:
df['F'] = s1

In [195]:
df

                   A         B         C         D    F
2013-01-01  0.136832  0.724132  0.802138  0.062648  NaN
2013-01-02  0.228260 -0.140629  1.741682  0.774716  1.0
2013-01-03 -0.605779  0.985320 -0.887563  1.151283  2.0
2013-01-04 -0.732915  0.556554  0.423794 -2.298821  3.0
2013-01-05  0.930900  2.660939  0.331002 -1.639093  4.0
2013-01-06 -0.251515 -0.736109  0.908339  0.517833  5.0

In [196]:
df['A']

2013-01-01    0.136832
2013-01-02    0.228260
2013-01-03   -0.605779
2013-01-04   -0.732915
2013-01-05    0.930900
2013-01-06   -0.251515
Freq: D, Name: A, dtype: float64

In [197]:
type(df['A'])

pandas.core.series.Series

In [198]:
type(df['F'])

pandas.core.series.Series

In [199]:
type(df)

pandas.core.frame.DataFrame

In [201]:
df.iloc[0,4]

nan

In [202]:
type(df.iloc[0,4])

numpy.float64

nan